[
  {
    "id": 1,
    "arabic": "ٱلرَّحْمَٰنُ",
    "translations": {
      "english": {
        "name": "Ar-Rahmān – The Most Merciful",
        "details": "Ar-Rahmān is one of Allah’s most profound Names, meaning The Most Merciful whose mercy encompasses all creation. His mercy extends to everyone—believer and disbeliever, obedient and sinful. The sun, rain, health, and sustenance are all reflections of this Divine Mercy.",
        "lesson": "We should learn to show mercy, kindness, and compassion in our daily lives, just as Allah’s mercy reaches all beings.",
        "virtues": "Believing in Ar-Rahmān brings peace and hope, reminding us that Allah’s mercy is greater than any sin. It encourages repentance, humility, and a stronger bond with Allah.",
        "wazifa": "After every Salah, whoever recites this 7 times will stay safe from the evil of Satan and his end will be on Iman."
      },
      "urdu": {
        "name": "الرَّحْمٰن – سب سے زیادہ رحم فرمانے والا",
        "details": "الرَّحْمٰن اللہ تعالیٰ کا وہ عظیم نام ہے جو قرآنِ مجید میں بارہا آیا ہے۔ اس کا مطلب ہے سب سے زیادہ رحم کرنے والا، جس کی رحمت ہر مخلوق پر محیط ہے۔ اللہ کی رحمت صرف مومنوں تک محدود نہیں بلکہ کافروں، گناہگاروں اور تمام مخلوقات تک پھیلی ہوئی ہے۔ سورج کا نکلنا، بارش کا برسنا، صحت، روزی اور بے شمار نعمتیں اسی رحمتِ الٰہی کی جھلک ہیں۔",
        "lesson": "اس نام سے ہمیں یہ سبق ملتا ہے کہ ہمیں بھی اپنی زندگی میں رحم، نرمی اور محبت کو اپنانا چاہیے۔ جس طرح اللہ تعالیٰ اپنی رحمت سب پر عام کرتا ہے، ہمیں بھی دوسروں کے ساتھ شفقت اور مہربانی سے پیش آنا چاہیے۔",
        "virtues": "الرَّحْمٰن پر ایمان انسان کے دل میں امید اور سکون پیدا کرتا ہے۔ یہ یقین دلاتا ہے کہ چاہے کتنے ہی گناہ کیوں نہ ہوں، اللہ کی رحمت ان سب سے بڑی ہے۔ یہ نام بندے کو توبہ، عاجزی اور اللہ سے محبت کی طرف مائل کرتا ہے۔",
        "wazifa": "ہر نماز کے بعد اس نام کو 7 مرتبہ پڑھنے والا شیطان کے شر سے محفوظ رہتا ہے اور اس کا خاتمہ ایمان پر ہوتا ہے۔"
      }
    }
  },
  {
    "id": 2,
    "arabic": "ٱلرَّحِيمُ",
    "translations": {
      "english": {
        "name": "Ar-Rahīm – The Especially Merciful",
        "details": "Ar-Rahīm is another magnificent Name of Allah, often mentioned together with Ar-Rahmān in the Qur’an. While both Names come from the root rahmah (mercy), the difference is that Ar-Rahmān refers to Allah’s all-encompassing mercy for all creation, whereas Ar-Rahīm refers to His special mercy reserved for the believers.",
        "lesson": "The lesson from Ar-Rahīm is that we should also show lasting kindness and compassion, especially towards those close to us—our families, friends, and fellow believers. Just as Allah’s mercy for the believers is continuous and deep, our relationships should reflect patience, forgiveness, and care.",
        "virtues": "Believing in Ar-Rahīm reassures the believer that Allah’s mercy will always cover them if they hold on to faith and righteousness. It strengthens hope, motivates obedience, and prevents despair even after committing sins.",
        "wazifa": "Whoever recites this 500 times daily will attain wealth, and people will become kind and compassionate towards him."
      },
      "urdu": {
        "name": "الرَّحِيم – ہمیشہ رحم فرمانے والا",
        "details": "الرَّحِيم اللہ تعالیٰ کا ایک اور عظیم نام ہے جو اکثر الرَّحْمٰن کے ساتھ قرآنِ مجید میں ذکر ہوا ہے۔ دونوں نام رحمت کے مادہ سے نکلے ہیں، لیکن ان کے درمیان فرق یہ ہے کہ الرَّحْمٰن اللہ کی عام رحمت کو ظاہر کرتا ہے جو تمام مخلوقات کے لیے ہے، جبکہ الرَّحِيم اللہ کی خاص اور دائمی رحمت کو ظاہر کرتا ہے جو صرف ایمان والوں کے لیے مخصوص ہے۔",
        "lesson": "الرَّحِيم کا سبق یہ ہے کہ ہمیں بھی اپنی زندگی میں مستقل اور گہری شفقت پیدا کرنی چاہیے، خاص طور پر اپنے قریبی رشتوں، دوستوں اور اہلِ ایمان کے ساتھ۔ جس طرح اللہ کی رحمت ایمان والوں کے لیے ہمیشہ قائم رہتی ہے، اسی طرح ہمیں بھی اپنے تعلقات میں صبر، معافی اور محبت کو اپنانا چاہیے۔",
        "virtues": "الرَّحِيم پر ایمان رکھنے سے مومن کا دل مطمئن رہتا ہے کہ اللہ کی خاص رحمت ہمیشہ اُس پر سایہ فگن ہے اگر وہ ایمان اور نیکی پر قائم رہے۔ یہ یقین انسان کو امید بخشتا ہے، اطاعت پر ابھارتا ہے اور گناہوں کے باوجود مایوسی سے بچاتا ہے۔",
        "wazifa": "جو شخص اسے روزانہ 500 مرتبہ پڑھے گا، اسے دولت ملے گی اور لوگ اس کے ساتھ مہربان اور شفیق ہو جائیں گے۔"
      }
    }
  },
  {
    "id": 3,
    "arabic": "ٱلْمَلِكُ",
    "translations": {
      "english": {
        "name": "Al-Malik – The King and Owner of Dominion",
        "details": "Al-Malik is one of the majestic Names of Allah, meaning The King, The Absolute Sovereign, The Owner of all Dominion. It declares that Allah alone possesses complete authority and control over the entire universe. He is the true King, while all worldly kings and rulers are only temporary and limited in their power.",
        "lesson": "The lesson of Al-Malik is that we should submit fully to Allah’s rule, obey His commands, and live with gratitude for His blessings. Just as Allah is the true King, we must recognize that our own authority and possessions are temporary trusts, and we should use them with justice, humility, and responsibility.",
        "virtues": "Believing in Al-Malik reminds us that ultimate power, honor, and control belong only to Allah. It frees the heart from fear of worldly rulers or dependence on material possessions. It also strengthens humility, as humans realize they are servants of the true King.",
        "wazifa": "When recited 90 times daily by a poor and destitute person, he will be relieved of poverty."
      },
      "urdu": {
        "name": "الْمَلِك – بادشاہ اور کائنات کا مالک",
        "details": "الْمَلِك اللہ تعالیٰ کا جلالت والا نام ہے، جس کا مطلب ہے بادشاہ، مطلق حاکم، اور کائنات کا حقیقی مالک۔ یہ اعلان کرتا ہے کہ صرف اللہ ہی کے پاس پوری کائنات کی بادشاہت اور اختیار ہے۔ دنیا کے تمام بادشاہ اور حکمران وقتی اور محدود ہیں، جبکہ اللہ کی بادشاہت ابدی اور کامل ہے۔",
        "lesson": "الْمَلِك کا سبق یہ ہے کہ ہمیں اپنی زندگی میں اللہ کے حکم کے سامنے سرِتسلیم خم کرنا چاہیے، اُس کے قوانین پر عمل کرنا چاہیے اور اُس کی نعمتوں پر شکر گزار رہنا چاہیے۔ جس طرح اللہ حقیقی بادشاہ ہے، اسی طرح ہمیں اپنی وقتی طاقت اور اختیار کو انصاف، عاجزی اور ذمہ داری کے ساتھ استعمال کرنا چاہیے۔",
        "virtues": "الْمَلِك پر ایمان ہمیں یاد دلاتا ہے کہ اصل طاقت، عزت اور اختیار صرف اللہ ہی کا ہے۔ یہ دل کو دنیاوی حکمرانوں کے خوف سے آزاد کرتا ہے اور مادی چیزوں پر بھروسے سے بچاتا ہے۔ یہ نام انسان کو عاجزی سکھاتا ہے کہ وہ حقیقت میں ایک بندہ ہے اور اُس کا رب ہی اصل بادشاہ ہے۔",
        "wazifa": "جو شخص اسے روزانہ 90 مرتبہ پڑھے گا، خاص طور پر اگر وہ غریب اور محتاج ہو، تو اللہ تعالیٰ اسے غربت سے نجات عطا فرمائے گا۔"
      }
    }
  },
  {
    "id": 4,
    "arabic": "ٱلْقُدُّوسُ",
    "translations": {
      "english": {
        "name": "Al-Quddūs – The Absolutely Pure",
        "details": "Al-Quddūs means The Absolutely Pure, The Most Holy, The One who is free from all imperfections, faults, or weaknesses. Allah is completely pure from any defect, partner, or limitation. His essence, attributes, and actions are perfect and beyond human imagination.",
        "lesson": "The lesson of Al-Quddūs is that we should work to purify our souls, words, and deeds. Our worship should be sincere and free of showing off, and our hearts should be cleansed from hatred, jealousy, and hypocrisy.",
        "virtues": "Reciting 'Yā Quddūs' brings inner peace, purifies the heart, and draws a person closer to Allah. It helps one remain steadfast on the path of righteousness and stay away from impurities of sins.",
        "wazifa": "1) Whoever recites 'Yā Quddūs' 100 times after Tahajjud, Allah purifies their heart from hypocrisy and fills it with tranquility. 2) Reciting it daily 100 times cleanses the soul and removes sinful desires. 3) Frequently reciting 'Subbūhun Quddūsun Rabbunā wa Rabbul-Malā’ikati war-Rūh' (Hadith: Sahih Muslim) grants peace and protection from harm."
      },
      "urdu": {
        "name": "الْقُدُّوس – بالکل پاک ذات",
        "details": "الْقُدُّوس کا مطلب ہے بالکل پاک، بے عیب، مقدس ذات۔ اللہ ہر کمی، ہر عیب اور ہر خامی سے پاک ہے۔ اُس کی ذات، صفات اور افعال سب کامل ہیں۔ اُس جیسا کوئی نہیں اور اُس میں کوئی نقص یا کمزوری نہیں۔",
        "lesson": "اس نام سے سبق ملتا ہے کہ ہمیں اپنی عبادت خالص نیت سے کرنی چاہیے اور اپنے دل کو حسد، بغض اور نفاق سے صاف رکھنا چاہیے۔",
        "virtues": "یَا قُدُّوس کا ورد دل کو سکون دیتا ہے، باطن کو پاک کرتا ہے اور انسان کو اللہ کے قریب لے جاتا ہے۔ یہ انسان کو گناہوں کی ناپاکی سے بچاتا ہے۔",
        "wazifa": "1) جو شخص تہجد کے بعد 'یَا قُدُّوس' 100 مرتبہ پڑھے اللہ اس کے دل کو نفاق سے پاک کر دیتا ہے۔ 2) روزانہ 100 مرتبہ پڑھنے سے روح پاکیزہ ہوتی ہے اور برے خیالات دور ہوتے ہیں۔ 3) 'سُبُّوحٌ قُدُّوسٌ رَبُّنَا وَرَبُّ الْمَلَائِكَةِ وَالرُّوحِ' پڑھنے سے امن اور حفاظت نصیب ہوتی ہے (صحیح مسلم)۔"
      }
    }
  },
  {
    "id": 5,
    "arabic": "ٱلسَّلَامُ",
    "translations": {
      "english": {
        "name": "As-Salām – The Perfection and Giver of Peace",
        "details": "As-Salām means The One who is Perfect and free from all defects, and The One who grants peace, safety, and well-being to His creation. Allah is the source of peace and perfection; He is free from any weakness, injustice, or imperfection, and He bestows tranquility upon His servants.",
        "lesson": "The lesson of As-Salām is that we should spread peace among people through our words and actions, avoid harming others, and live with sincerity and kindness.",
        "virtues": "Reciting 'Yā Salām' grants protection from dangers, brings peace of mind, removes anxiety, and blesses the heart with tranquility.",
        "wazifa": "1) Recite 'Yā Salām' 131 times daily after Fajr prayer for peace of heart and protection from calamities. 2) Reciting it frequently while traveling grants safety from accidents and hidden harms. 3) The Prophet ﷺ used to say after Salah: 'Allāhumma anta As-Salām wa minka As-Salām tabārakta yā dhā-l-jalāli wa-l-ikrām' (Sahih Muslim) – whoever recites this gains peace and divine protection."
      },
      "urdu": {
        "name": "السَّلَام – سراسر سلامتی دینے والا",
        "details": "السَّلَام کا مطلب ہے وہ ذات جو ہر عیب اور نقص سے پاک ہے اور اپنی مخلوق کو سلامتی، امن اور خیر عطا کرتی ہے۔ اللہ ہی اصل سلامتی اور کمال کا سرچشمہ ہے۔ اُس میں کوئی کمزوری، ظلم یا نقص نہیں ہے، اور وہ اپنے بندوں کو دنیا و آخرت میں امن عطا کرتا ہے۔",
        "lesson": "اس نام سے سبق یہ ملتا ہے کہ ہمیں بھی لوگوں کے ساتھ امن و سلامتی سے پیش آنا چاہیے، ان کو ایذا نہ پہنچائیں اور خیرخواہی و نرمی کے ساتھ زندگی گزاریں۔",
        "virtues": "یَا سَلَام کا ورد انسان کو خطرات سے محفوظ رکھتا ہے، دل سے خوف اور پریشانی کو دور کرتا ہے اور اندرونی سکون عطا کرتا ہے۔",
        "wazifa": "1) جو شخص فجر کے بعد 'یَا سَلَام' 131 مرتبہ پڑھے اللہ تعالیٰ اس کے دل کو سکون اور حفاظت عطا فرماتا ہے۔ 2) سفر میں کثرت سے پڑھنے والا حادثات اور خطرات سے بچتا ہے۔ 3) نبی ﷺ نماز کے بعد یہ دعا پڑھتے تھے: 'اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإكْرَامِ' (صحیح مسلم) – اس کو پڑھنے والا اللہ کے امن میں آ جاتا ہے۔"
      }
    }
  }
]
